import { Skills } from "@/types/skills";

export const skills: Skills[] = [
  {
    stack: "HTML5 / CSS",
    skillList: [
      "웹 서비스를 설계할 때 시각적인 부분뿐만 아니라 개발에 맞춰 만들기 위해 노력합니다.",
      "웹 표준을 지키고 웹 접근성 개선에 노력합니다.",
    ],
  },
  {
    stack: "JavaScript",
    skillList: [
      "실행 컨텍스트, 호출 스택과 이벤트 루프의 동작 원리를 이해하여 사용합니다.",
      "적절한 함수 분리를 통해 코드의 가독성을 높이고 유지보수성을 향상시킵니다.",
      "클린코드를 작성하기 위해 고민합니다.",
    ],
  },
  {
    stack: "Java",
    skillList: [
      "화면에서 받아야 하는 Data를 적절한 형으로 처리 후 보낼 수 있습니다.",
      "화면서에 받은 Data를 처리하여 xml로 보낼 수 있습니다.",
      "클린코드를 작성하기 위해 고민합니다.",
    ],
  },
  {
    stack: "Oracle",
    skillList: [
      "적절한 SQL문법을 사용하여 정확한 Data를 도출해 내기위해 노력합니다.",
      "테이블이나 컬럼을 남발하여 생성하지 않습니다.",
    ],
  },
  {
    stack: "Git / Bitbucket",
    skillList: [
      "팀원들의 작업물과 얽히지 않도록 풀받는 습관을 가지고 있습니다.",
      "소스가 꼬이게 되었을 때 커밋취소 등의 방법을 숙지하고 있습니다.",
    ],
  },
  {
    stack: "Linux",
    skillList: [
      "SSH 혹은 pem 파일을 통해 서버에 접속할 수 있습니다.",
      "관리자 권한을 이해하고 파일 수정, 폴더 생성 등을 할 수 있습니다.",
    ],
  },
  {
    stack: "nextJs",
    skillList: [
      "API 연결을 하여 데이터를 받아와 화면에서 처리 할 수 있습니다.",
      "백과 프론트를 구분하여 작업할 수 있습니다.",
    ],
  },
];
